[
    {
        "id": 1,
        "date": "2023-01-01",
        "category": "Mini Apps",
        "coverPhoto": "../data/img/colorChange/banner.png",
        "mainTitle": "Color Changer",
        "subTitle1": "JavaScript öğrenirken yaptığım ilk projelerden biri",
        "description1": "Bu proje sayesinde rastgele sayı üretmeyi ve bu sayıları rastgele HEX renk kodlarına dönüştüren bir fonksiyon oluşturmayı öğrendim.",
        "img1": "../data/img/colorChange/1.png",
        "subTitle2": "Peki sayıları HEX renk koduna nasıl mı çevirdim? ",
        "description2": "For döngüsü ile Math.random() ve Math.floor() fonksiyonlarını kullanarak 0–15 arası rasgele bir sayı ürettim ve bu sayıyı 6 karakterli bir HEX renk kodu oluşturmak için kullandım.",
        "img2": "../data/img/colorChange/2.png"
    },
    {
        "id": 2,
        "date": "2023-02-01",
        "category": "Mini Apps",
        "coverPhoto": "../data/img/digitalClock/banner.png",
        "mainTitle": "Digital Clock",
        "subTitle1": "JavaScript ile dinamik saat ve tarih gösteren uygulama",
        "description1": "Bu proje sayesinde JavaScript’in Date nesnesini kullanarak güncel saat ve tarihi almayı öğrendim ve ekranda gösterecek bir fonksiyon oluşturdum.",
        "img1": "../data/img/digitalClock/1.png",
        "subTitle2": "Projenin bana katkıları: DOM manipülasyonu, ternary operatörü ve dinamik güncelleme.",
        "description2": "HTML elementlerini document.getElementById() ile seçip innerText ile güncelledim. Ternary operatörü kullanarak sayıları koşula bağlı olarak formatladım ve setInterval fonksiyonu ile saatin her saniye otomatik güncellenmesini sağladım.",
        "img2": "../data/img/digitalClock/2.png"
    },
    {
        "id": 3,
        "date": "2023-03-01",
        "category": "Web Sites",
        "coverPhoto": "../data/img/coffeeShop/banner.png",
        "mainTitle": "Coffee Shop Website",
        "subTitle1": "Responsive ve mobil uyumlu tasarım öğrenme projesi",
        "description1": "Bu proje sayesinde web sitelerini mobil cihazlara uygun hale getirmek için responsive tasarım tekniklerini öğrendim. CSS media query kullanımı ve esnek layoutlarla farklı ekran boyutlarına uyum sağlamayı uyguladım.",
        "img1": "../data/img/coffeeShop/1.png",
        "subTitle2": "Projenin bana katkıları",
        "description2": "Mobil-first yaklaşımı ve responsive tasarım sayesinde kullanıcı deneyimini artırmayı, farklı cihazlarda site düzenini korumayı ve CSS ile esnek grid/column sistemlerini kullanmayı öğrendim.",
        "img2": "../data/img/coffeeShop/2.png",
        "subTitle3": "Hadi mobilde nasıl göründüğüne de bakalım",
        "description3": "A collection of my work showcasing various projects and achievements.",
        "img3": "../data/img/coffeeShop/3.png"
    },
    {
        "id": 4,
        "date": "2023-04-01",
        "category": "Mini Apps",
        "coverPhoto": "../data/img/gallery/banner.png",
        "mainTitle": "Gallery",
        "subTitle1": "Yatay kaydırılabilir galeri tasarımı",
        "description1": "Proje, sağ ve sol ikonlara tıklandığında gallery öğelerinin yatay olarak kaydırılmasını sağlıyor. Ayrıca, fare ile siyah-beyaz görsellerin üzerine gelindiğinde görseller büyüyor ve orijinal renklerine dönüyor.",
        "img1": "../data/img/gallery/1.png",
        "subTitle2": "Bu projede neler öğrendim?",
        "description2": "scrollLeft özelliği ve scrollBehavior kullanarak öğelerin kaydırılmasını sağladım. Ayrıca butonlara tıklama ve fare tekerleği ile kaydırma etkileşimlerini uygulayarak kullanıcı deneyimini geliştirdim.",
        "img2": "../data/img/gallery/2.png"
    },
    {
        "id": 5,
        "date": "2023-05-01",
        "category": "Tools",
        "coverPhoto": "../data/img/contact/banner.png",
        "mainTitle": "Contact Form",
        "subTitle1": "İletişim Formunu gmail ile optimize etmek",
        "description1": "Bu projede, kullanıcıların isim, e-posta ve mesajlarını girebileceği bir iletişim formu tasarladım.",
        "img1": "../data/img/contact/1.png",
        "subTitle2": "Peki bu projenin amacı ne?",
        "description2": " Form Web3Forms ile e-posta adresine bağlanarak mesajların doğrudan mail kutusuna iletilmesini sağlıyor.",
        "img2": "../data/img/contact/2.png",
        "subTitle3": "Deneme yapalım!",
        "description3": "Kendime bir mesaj atıyorum ve mail kutumu kontrol ediyorum.",
        "img3": "../data/img/contact/3.png"
    },
    {
        "id": 6,
        "date": "2023-06-01",
        "category": "Web Sites",
        "coverPhoto": "../data/img/eCommerce/banner.png",
        "mainTitle": "E-Commerce Website",
        "subTitle1": "Modern ve etkileşimli e-ticaret arayüzü",
        "description1": "Bu proje, kullanıcı dostu bir e-ticaret deneyimi sunmak için tasarlandı. Menü, arama motoru, sepet ve üye girişi ile etkileşimli bir kullanım sağlanıyor. Responsive tasarım ile tüm cihazlarda uyumlu bir deneyim sunuyor.",
        "img1": "../data/img/eCommerce/1.png",
        "subTitle2": "Bu projenin bana katkıları: Swiper ve Scroll kullanımı",
        "description2": "Scroll ile menü ve ikonlara tıklanıldığında diğer öğelerin kapanmasını sağlayarak temiz bir arayüz elde ettim. Swiper kullanarak ürün kaydırıcıları oluşturdum ve responsive tasarım ile farklı ekran boyutlarına uyum sağladım.",
        "img2": "../data/img/eCommerce/2.png"
    },
    {
        "id": 7,
        "date": "2023-07-01",
        "category": "Mini Apps",
        "coverPhoto": "../data/img/pomodoro/banner.png",
        "mainTitle": "Pomodoro Timer",
        "subTitle1": "İhtiyaç dahilinde oluşturduğum projem",
        "description1": "Pomodoro tekniğini kullanarak zaman yönetimi sağlayan bir uygulama geliştirdim. Bu proje, odaklanmayı artırmak ve verimliliği artırmak için 25 dakikalık çalışma süreleri ve 5 dakikalık molalar sunuyor. ",
        "img1": "../data/img/pomodoro/1.png",
        "subTitle2": "Peki bu projede neler mi öğrendim?",
        "description2": "setInterval ile saniye ve dakika sayacı oluşturuldu, çalışma ve mola süreleri arasında breakCount ile geçiş sağlandı. Aktif süreler CSS ile görsel olarak vurgulandı. Start ve reset butonları ile kullanıcı kontrolü eklendi. Kod modüler ve okunabilir şekilde tasarlandı, sürelerin otomatik geçişi ve görsel bildirimler sağlandı.",
        "img2": "../data/img/pomodoro/2.png"
    },
    {
        "id": 8,
        "date": "2023-08-01",
        "category": "Mini Apps",
        "coverPhoto": "../data/img/flashCard/banner.png",
        "mainTitle": "Language Flashcards App",
        "subTitle1": "Verileri saklayabileceğim kişisel sözlüğüm",
        "description1": "Bu proje, kullanıcıların English-Turkish şeklinde kendi flash kartlarını oluşturmasını sağlayan bir uygulamadır. Kart ekleme, düzenleme, silme ve cevap göster/gizle fonksiyonları ile tamamen etkileşimli bir deneyim sunar.",
        "img1": "../data/img/flashCard/1.png",
        "subTitle2": "Bu projede neler öğrendim?",
        "description2": "querySelector ve classList.toggle ile etkileşimli öğeler oluşturmayı, event listenerlarla kullanıcı etkileşimini yönetmeyi ve localStorage kullanarak verileri saklamayı öğrendim. Ayrıca edit ve delete işlevleri ile dinamik içerik yönetimi sağladım.",
        "img2": "../data/img/flashCard/2.png"
    },
    {
        "id": 9,
        "date": "2023-09-01",
        "category": "Web Sites",
        "coverPhoto": "../data/img/honeyShop/banner.png",
        "mainTitle": "Honey shop website",
        "subTitle1": "Modern ve etkileşimli arayüz ile e-ticaret deneyimi",
        "description1": "Kullanıcı dostu ve görsel olarak çekici bir e-ticaret sitesi olan bu siteye JavaScript ile bir çok efekt ekledim ve dinamik bir site tasarımı yaptım.",
        "img1": "../data/img/honeyShop/1.png",
        "subTitle2": "Dinamik header ve kullanıcı etkileşimleri",
        "description2": "Proje kapsamında, kullanıcı deneyimini geliştirmek için sayfa kaydırma ile sticky header ve animasyonlar ekledim. Menü butonuna tıklayınca açılır/kapanır menü tasarladım ve ScrollReveal kütüphanesi ile sayfa öğelerine giriş animasyonları uyguladım. Bu sayede site hem görsel olarak çekici hem de etkileşimli hale geldi.",
        "img2": "../data/img/honeyShop/2.png",
        "subTitle3": "Projenin bana katkıları",
        "description3": "window.scroll ve classList.toggle ile dinamik header oluşturmayı, onclick ve onscroll eventleri ile menü etkileşimlerini yönetmeyi ve ScrollReveal ile modern animasyon efektleri eklemeyi öğrendim. Kullanıcı deneyimi odaklı interaktif web tasarım becerilerimi geliştirdim.",
        "img3": "../data/img/honeyShop/3.png"
    },
    {
        "id": 10,
        "date": "2023-10-01",
        "category": "UI/UX",
        "coverPhoto": "../data/img/darkmode/banner.png",
        "mainTitle": "Dark Mode",
        "subTitle1": "Kullanıcı deneyimini geliştiren bir tema",
        "description1": "Bu proje, kullanıcıların sayfa temasını değiştirebilmesi için tamamen HTML ve CSS kullanılarak tasarlandı. Checkbox input ve label ile toggle mekanizması oluşturuldu. CSS pseudo-elementleri ve transition özellikleriyle animasyonlu geçişler sağlandı. Sun ve moon ikonları, temaya göre renk değiştiriyor. Arka plan ve toggle butonu tamamen CSS ile kontrol ediliyor.",
        "img1": "../data/img/darkmode/dark.png",
        "subTitle2": "Bu projede neler öğrendim?",
        "description2": "CSS ile toggle mekanizması oluşturmayı, pseudo-elementleri (label::after) kullanmayı, transition ile animasyonlu geçişler yapmayı ve checkbox input ile interaktif özellikler eklemeyi öğrendim. JavaScript kullanmadan tamamen stil ile kullanıcı etkileşimi sağlanabileceğini gördüm.",
        "img2": "../data/img/darkmode/light.png"
    },
    {
        "id": 11,
        "date": "2023-11-01",
        "category": "Utility Apps",
        "coverPhoto": "../data/img/toDoList/banner.png",
        "mainTitle": "To Do List",
        "subTitle1": "Basit ve interaktif görev yönetim uygulaması",
        "description1": "Bu proje, kullanıcıların günlük görevlerini ekleyip yönetebileceği basit bir To-Do List uygulamasıdır. Kullanıcı bir görev eklediğinde listeye öğe eklenir...",
        "img1": "../data/img/toDoList/2.png",
        "subTitle2": "Eklediğimiz görevlerin son durumu için bazı özellikler daha ekledim. ",
        "description2": "Görev tamamlandığında tıklayarak işaretlenebilir ve istenmeyen öğeler silinebilir!",
        "img2": "../data/img/toDoList/1.png",
        "subTitle3": "Projenin bana katkıları",
        "description3": "DOM manipülasyonu ile öğe ekleme ve silme işlemlerini, classList.toggle ile görev tamamlama işaretlemeyi ve LocalStorage ile veri kalıcılığını öğrendim. Ayrıca event delegation kullanarak tek bir click listener ile tüm liste öğelerini yönetebileceğimi gördüm.",
        "img3": "../data/img/toDoList/3.png"
    },
    {
        "id": 12,
        "date": "2023-12-01",
        "category": "Tools",
        "coverPhoto": "../data/img/imgSearch/banner.png",
        "mainTitle": "Image Search Engine",
        "subTitle1": "Görsel arama motoru uygulaması",
        "description1": "Bu proje, kullanıcıların anahtar kelime ile görsel araması yapabilmesini sağlar. Unsplash API kullanılarak anlık arama sonuçları getirilir ve 'Daha Fazla' butonu ile sayfalama yapılabilir.",
        "img1": "../data/img/imgSearch/1.png",
        "subTitle2": "Bu projede neler öğrendim?",
        "description2": "Async/await ile API çağrısı yapmayı, form ve buton eventlerini yönetmeyi, DOM üzerinde dinamik içerik oluşturmayı ve responsive tasarım uygulamayı öğrendim.",
        "img2": "../data/img/imgSearch/2.png"
    },
    {
        "id": 13,
        "date": "2023-12-02",
        "category": "Web Sites",
        "coverPhoto": "../data/img/bomiBlog/banner.png",
        "mainTitle": "News and Blog Website",
        "subTitle1": "Blogumun anasayfası",
        "description1": "Burada tüm içerikleri kategorilere ayırdım ve tüm verileri Json'a kaydettim. Bu şekilde anasayfamdaki tüm içerikler otomatik olarak Jsondan gelecek. İŞTE ANASAYFAM!",
        "img1": "../data/img/bomiBlog/page1.png",
        "subTitle2": "ve Devamı..",
        "description2": "Buraya slider ve son eklenen yazıları ekleyerek sitenin dinamikliğini artırdım.",
        "img2": "../data/img/bomiBlog/page2.png",
        "subTitle3": "Anasayfamdaki kategoriler alanını kullanıcı deneyimini ön planda tutarak tasarladım",
        "description3": "Anasayfamda tüm kategorileri ayrı ayrı görebileceğimiz bir alan da yarattım. Bu şekilde tüm haber, blog, spor, teknoloji ve daha fazlası ayrı ayrı sayfalarda kategorize edilecek. Ayrıca bu alanlara kulanıcının ilgisini çekebilecek ve yeni eklenen içeriklerden haberdar edecek sidebarlar ekledim. Bu kullanıcıyı daha fazla sitede tutmayı sağlayacak.",
        "img3": "../data/img/bomiBlog/page3.png",
        "subTitle4": "Blog ve Haberlerin içerikleri için",
        "description4": "İlgimizi çeken içeriklerden herhangi birine tıklanınca detay sayfasına yönlendirileceğiz. Bu sayfanın içeriklerini ise jsondan çektiğimiz verileri uygun yerlere yerleştirerek oluşturdum. Aslında bu portfolyo projesini de blog sitemi yaparkenki edindiğim bilgiler ile yaptım.",
        "img4": "../data/img/bomiBlog/page4.png",
        "subTitle5": "Gelelim Dark mode da nasıl göründüğüne",
        "description5": "Artık tüm applicationlar için darkmode desteği mevcut. Benim sitemde neden olmasın ki?",
        "img5": "../data/img/bomiBlog/page6.png",
        "subTitle6": "Son olarak, bu projede neler öğrendim?",
        "description6": "CSS değişkenleriyle dark mode geçişini yönetmeyi, Swiper ile responsive slider hazırlamayı, JSON verilerini fetch ile çekip tarihe göre sıralayarak hem öne çıkan hem de son eklenen içerikleri dinamik ve sayfalı biçimde eklemeyi, detay sayfalarına yönlendirmeyi ve tüm süreci modüler hale getirmeyi öğrendim.",
        "img6": "../data/img/bomiBlog/page7.png"
    }
]